questions = {
    "인식능력": [
        {"id": 1, "question": "나는 나 자신의 학습을 위해 가장 적합한 방법을 선택할 수 있다."},
        {"id": 2, "question": "나는 나 자신의 학습에 대해 책임이 있다."},
        {"id": 3, "question": "나는 나의 학습 목표를 세우고 계획할 수 있다."}
    ],
    "학습전략": [
        {"id": 1, "question": "나는 배우는 내용의 예시를 찾아보는 것이 도움이 된다고 생각한다."},
        {"id": 2, "question": "내 내적 동기는 학습에서 나를 더욱 발전시키고 향상시키는 방향으로 이끈다."},
        {"id": 3, "question": "나는 개념도가 학습에 효과적인 방법이라고 생각한다."}
    ],
    "학습활동": [
        {"id": 1, "question": "나는 새로운 수업을 미리 연습하고 검토한다."},
        {"id": 2, "question": "나는 방대한 정보를 이해하는 유용한 방법으로 개념도나 개요작성을 사용한다."},
        {"id": 3, "question": "나는 계속 나의 모든 생각들, 성찰, 새로운 학습에 대해 메모를 달거나 요약한다."}
    ],
    "자기평가": [
        {"id": 1, "question": "나는 성공과 실패가 모두 내가 더 많은 것을 학습하도록 영감을 준다고 생각한다."},
        {"id": 2, "question": "나는 나의 학습 목표를 달성했는지 여부를 모니터링한다."},
        {"id": 3, "question": "나는 나의 학습활동을 복습하고 성찰한다."}
    ],
    "의사소통과 협력": [
        {"id": 1, "question": "집단 내에서 나의 역할을 분명히 알 수 있다."},
        {"id": 2, "question": "나는 언어적 의사소통을 잘한다."},
        {"id": 3, "question": "다른 사람들과의 상호작용은 내가 더 많은 학습을 계획할 수 있는 통찰력을 개발하는데 도움이 된다."}
    ]
}
